app/controllers/locations_controller.rb

INSERT INTO "locations" ("name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["password", "\r\n"], ["created_at", "2016-05-16 11:14:33.746544"], ["updated_at", "2016-05-16 11:14:33.746544"]]
---
  def create
    @location = Location.new(location_params)

    if @location.save

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "locations" SET "name" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["name", "beijingk"], ["updated_at", "2016-05-17 04:41:21.319564"], ["id", 2]]
---
  def update
    @location = Location.find(params[:id])
    if @location.update(location_params)