app/controllers/passes_controller.rb

  def show
    @pass = Pass.find(params[:id])
---
SELECT  "passes".* FROM "passes" WHERE "passes"."id" = ? LIMIT 1  [["id", 13]]

  def create
    @salon = Salon.find(params[:salon_id])
    @pass = @salon.passes.create(pass_params)
    @pass.serial_number = new_serial_number
    @pass.authentication_token = new_authentication_token
    @pass.barcode_message = new_barcode_message

    if @pass.save
---
SELECT  "salons".* FROM "salons" WHERE "salons"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "passes" ("user_name", "user_phone_number", "user_type", "salon_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_name", "KKK"], ["user_phone_number", "15210350195"], ["user_type", "KKK"], ["salon_id", 2], ["created_at", "2016-05-16 13:52:52.111496"], ["updated_at", "2016-05-16 13:52:52.111496"]]
UPDATE "passes" SET "serial_number" = ?, "authentication_token" = ?, "barcode_message" = ?, "updated_at" = ? WHERE "passes"."id" = ?

  def wallet
    @pass = Pass.where(["serial_number = :p", { p: params[:serial_number] }]).first
---
SELECT  "passes".* FROM "passes" WHERE (serial_number = 'a908c7bfccf5a9bde096c98423bad37a')  ORDER BY "passes"."id" ASC LIMIT 1

  def download
    @pass = Pass.where(["serial_number = :p", { p: params[:serial_number] }]).first
---
SELECT  "passes".* FROM "passes" WHERE (serial_number = 'e8360bbc56f067786dcc73e05be31eff')  ORDER BY "passes"."id" ASC LIMIT 1

  def check
    @pass = Pass.where(["barcode_message = :p", { p: params[:barcode_message] }]).first
---
SELECT  "passes".* FROM "passes" WHERE (barcode_message = '0eb61c808fa36d1702f4783ae34fff6c')  ORDER BY "passes"."id" ASC LIMIT 1

  def destroy
    @salon = Salon.find(params[:salon_id])
    @pass = @salon.passes.find(params[:id])
    @pass.destroy
---
SELECT  "salons".* FROM "salons" WHERE "salons"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "passes".* FROM "passes" WHERE "passes"."salon_id" = ? AND "passes"."id" = ? LIMIT 1  [["salon_id", 3], ["id", 10]]
DELETE FROM "passes" WHERE "passes"."id" = ?  [["id", 10]]