app/controllers/salons_controller.rb

  def create
    @location = Location.find(params[:location_id])
    @salon = @location.salons.create(salon_params)
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "salons" ("name", "topic", "detail_location", "time", "detail_info", "guests", "help", "about", "longitude", "latitude", "foreground_color", "background_color", "iBeacon", "location_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    # @location = Location.find(params[:location_id])
    @salon = Salon.find(params[:id])
---
SELECT  "salons".* FROM "salons" WHERE "salons"."id" = ? LIMIT 1  [["id", 4]]

  def edit
    @salon = Salon.find(params[:id])
---
SELECT  "salons".* FROM "salons" WHERE "salons"."id" = ? LIMIT 1  [["id", 13]]

  def destroy
    @location = Location.find(params[:location_id])
    @salon = @location.salons.find(params[:id])
    @salon.destroy
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "salons".* FROM "salons" WHERE "salons"."location_id" = ? AND "salons"."id" = ? LIMIT 1  [["location_id", 3], ["id", 1]]
DELETE FROM "salons" WHERE "salons"."id" = ?  [["id", 1]]